//
//  Localizable.strings
//  Nextcloud iOS
//
//  Copyright © 2017 Marino Faggiana. All rights reserved.
//
//  Author Marino Faggiana <marino.faggiana@nextcloud.com>
//
//  This program is free software: you can redistribute it and/or modify
//  it under the terms of the GNU General Public License as published by
//  the Free Software Foundation, either version 3 of the License, or
//  (at your option) any later version.
//
//  This program is distributed in the hope that it will be useful,
//  but WITHOUT ANY WARRANTY; without even the implied warranty of
//  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
//  GNU General Public License for more details.
//
//  You should have received a copy of the GNU General Public License
//  along with this program.  If not, see <http://www.gnu.org/licenses/>.
//

// General

"_cancel_"                  = "Peruuta";
"_upload_file_"             = "Lähetä tiedosto";
"_download_file_"           = "Lataa tiedosto";
"_loading_"                 = "Ladataan";
"_loading_with_points_"     = "Ladataan…";
"_loading_num_"             = "Ladataan tiedostoa %i";
"_loading_autoupload_"      = "Automaattinen lähettäminen";
"_uploading_"               = "Lähetetään";
"_synchronization_"         = "Synkronointi";
"_delete_"                  = "Poista";
"_delete_file_n_"           = "Poistetaan tiedostoa %i / %i";
"_rename_"                  = "Nimeä uudelleen";
"_move_"                    = "Siirrä";
"_move_file_n_"             = "Siirretään tiedostoa %i / %i";
"_creating_sharing_"        = "Luodaan jakoa";
"_updating_sharing_"        = "Päivitetään jakoa";
"_removing_sharing_"        = "Poistetaan jakoa";
"_add_"                     = "Lisää";
"_login_"                   = "Kirjaudu";
"_save_"                    = "Tallenna";
"_warning_"                 = "Varoitus";
"_error_"                   = "Virhe";
"_error_e2ee_"              = "Virhe E2EE";
"_no_"                      = "Ei";
"_yes_"                     = "Kyllä";
"_select_"                  = "Valitse";
"_select_all_"              = "Valitse kaikki";
"_upload_"                  = "Lähetä";
"_home_"                    = "Tiedostot";
"_file_to_upload_"          = "Tiedosto lähetettäväksi";
"_destination_"             = "Määränpää";
"_ok_"                      = "OK";
"_beta_version_"            = "Beta-versio";
"_function_in_testing_"     = "Toimintoa testataan, ilmoita meille ongelmista tai virheistä.";
"_done_"                    = "Valmis";
"_passcode_too_short_"      = "Pääsykoodi on liian lyhyt, vähintään 4 merkkiä vaaditaan";
"_selected_"                = "Valittu";
"_scan_fingerprint_"        = "Tunnistaudu sormenjäljelläsi";
"_no_active_account_"       = "Tiliä ei löytynyt";
"_info_"                    = "Tietoa";
"_warning_"                 = "Varoitus";
"_email_"                   = "Sähköpostiosoite";
"_save_exit_"               = "Haluatko poistua tallentamatta?";
"_video_"                   = "Video";
"_overwrite_"               = "Ylikirjoita";
"_transfers_in_queue_"      = "Siirto käynnissä, odota…";
"_too_errors_automatic_all_"= "Liikaa virheitä, siirry ohjauskeskukseen tarkistaaksesi ongelman";
"_create_folder_"           = "Luo kansio";
"_create_folder_on_"        = "Luo kansio kohteeseen";
"_close_"                   = "Sulje";
"_postpone_"                = "Lykkää";
"_remove_"                  = "Poista";
"_file_not_found_"          = "Tiedostoa ei löytynyt";
"_continue_"                = "Haluatko jatkaa?";
"_auto_upload_folder_"      = "Automaattinen lähetys";
"_gallery_"                 = "Galleria";
"_photo_"                   = "Kuva";
"_audio_"                   = "Ääni";
"_unknown_"                 = "Tuntematon";
"_next_"                    = "Seuraava";
"_success_"                 = "Onnistui";
"_initialization_"          = "Alustus";
"_experimental_"            = "Kokeellinen";
"_select_dir_media_tab_"    = "Select as folder \"Media\"";
"_error_creation_file_"     = "Hups! Tiedostoa ei voitu luoda";
"_save_path_"               = "Save path";
"_save_settings_"           = "Tallenna asetukset";
"_mode_filename_"           = "Filename mode";
"_warning_owncloud_"        = "You are connected to an ownCloud server. This is untested and unsupported, use at your own risk. To upgrade to Nextcloud, see https://nextcloud.com/migration";
"_warning_unsupported_"     = "You are using an unsupported version of Nextcloud. For the safety of your data we strongly recommend updating to the latest stable Nextcloud";
"_restore_"                 = "Restore";
"_camera_roll_"             = "Camera roll";
"_tap_here_to_change_"      = "Tap here to change";
"_no_albums_"               = "Ei albumeita";
"_denied_album_"            = "This app does not have access to \"Photos\", you can enable access in Privacy Settings";
"_denied_camera_"           = "This app does not have access to \"Camera\", you can enable access in Privacy Settings";

// App

"_network_available_"       = "Verkko saatavilla";
"_network_not_available_"   = "Verkko ei ole saatavilla";

// Networking

"_file_too_big_"            = "File too large to be encrypted/decrypted";
"_file_too_big_max_100_"    = "File too large (max 100 kb.)";
"_...loading..._"           = "Ladataan…";
"_download_plist_"          = " ";
"_no_reuploadfile_"         = "Could not find nor resend file. Delete the upload and reload the file to upload it.";
"_file_already_exists_"     = "Toiminto epäonnistui, koska samanniminen tiedosto on jo olemassa";
"_read_file_error_"         = "TIedoston lukeminen epäonnistui";

// More

"_more_"                        = "Lisää";
"_notifications_"               = "Ilmoitukset";
"_logout_"                      = "Kirjaudu ulos";
"_quota_space_unlimited_"       = "Unlimited";
"_quota_space_unknown_"         = "Tuntematon";
"_quota_using_"                 = "Käytössäsi on %@/%@";

// Settings

"_acknowledgements_"            = "Acknowledgements";
"_settings_"                    = "Asetukset";
"_passcode_"                    = "Salasana";
"_lock_"                        = "Lukitus";
"_lock_active_"                 = "Lukitus: päällä";
"_lock_not_active_"             = "Lukitus: pois päältä";
"_lock_protection_no_screen_"        = "Älä kysy käynnistyksen yhteydessä";
"_lock_protection_no_screen_footer_" = "Use \"Do not ask at startup\" for protected folders only or for the encryption option";
"_url_"                         = "URL-osoite";
"_username_"                    = "Käyttäjätunnus";
"_change_credentials_"          = "Muuta tilitietojasi";
"_wifi_only_"                   = "Käytä vain Wi-Fi-yhteyttä";
"_settings_autoupload_"         = "Automaattinen lähetys";
"_app_version_"                 = "Sovellusversio";
"_app_in_use_"                  = "Application in use";
"_contact_by_email_"            = "Ota meihin yhteyttä sähköpostilla";
"_clear_cache_"                 = "Clear cache";
"_clear_cache_footer_"          = "Clear downloaded and offline files from the app";
"_exit_"                        = "Reset application";
"_exit_footer_"                 = "Poista kaikki tilit ja paikalliset tiedot sovelluksesta";
"_funct_not_enabled_"           = "Toiminnallisuutta ei ole otettu käyttöön";
"_passcode_activate_"           = "Password lock on";
"_disabling_passcode_"          = "Removing password lock";
"_want_exit_"                   = "Attention! Will be reset to initial state. Continue?";
"_proceed_"                     = "Jatka";
"_delete_cache_"                = "Poista välimuisti";
"_want_delete_cache_"           = "Haluatko tyhjentää välimuistin?";
"_delete_cache_and_db_"         = "Yes and remove the transfers in progress";
"_want_delete_thumbnails_"      = "Haluatko poistaa myös kaikki esikatselukuvat?";
"_mail_deleted_"                = "Sähköposti poistettu";
"_mail_saved_"                  = "Sähköposti tallennettu";
"_mail_sent_"                   = "Sähköposti lähetetty";
"_mail_failure_"                = "Sähköpostia: %@ ei voitu lähettää.";
"_information_req_"             = "Information request";
"_write_in_english_"            = "Kindly write to us in English";
"_credentials_"                 = "Tilitiedot";
"_manage_account_"              = "Tilin hallinta";
"_change_password_"             = "Vaihda salasana";
"_add_account_"                 = "Lisää tili";
"_delete_account_"              = "Poista tili";
"_want_delete_"                 = "Haluatko varmasti poistaa?";
"_no_delete_"                   = "Ei, älä poista";
"_yes_delete_"                  = "Kyllä, poista";
"_remove_cache_"                = "Odota, poistetaan välimuistia…";
"_optimizations_"               = "Optimoinnit";
"_synchronizations_"            = "Synkronoidut kansiot";
"_version_server_"              = "Palvelimen versio";
"_help_"                        = "Ohje";
"_lock_protection_simply_"      = "Heikko salasanasuojaus";
"_change_simply_passcode_"      = "Vaihda salasanan tyyppiä";
"_quota_"                       = "Kiintiö";
"_available_"                   = "saatavilla";
"_cloud_account_"               = "Pilvitunnus";
"_information_"                 = "Tiedot";
"_personal_information_"        = "Henkilökohtaiset tiedot";
"_user_full_name_"              = "Koko nimi";
"_user_address_"                = "Osoite";
"_user_phone_"                  = "Puhelinnumero";
"_user_email_"                  = "Sähköpostiosoite";
"_user_web_"                    = "Verkkosivusto";
"_user_twitter_"                = "Twitter";
"_favorite_offline_"            = "Suosikit saatavilla offline";
"_favorite_offline_footer_"     = "Making all favorites available offline may take a while and use a lot of memory while doing it.";
"_advanced_"                    = "Lisäasetukset";
"Skip"                          = "Ohita";
"Start"                         = "Aloita";
"_disable_files_app_"           = "Disable Files App integration";
"_disable_files_app_footer_"    = "Do not permit the access of files across the Apple Files application";

// Manage AutoUpload

"_autoupload_"                      = "Lähetä kuvia/videoita automaattisesti";
"_autoupload_select_folder_"        = "Select the \"Auto upload\" folder";
"_autoupload_error_select_folder_"  = "Select a valid folder for the \"Auto upload\"";
"_autoupload_background_"           = "Lähetä automaattisesti taustalla";
"_autoupload_photos_"               = "Lähetä kuvia automaattisesti";
"_autoupload_videos_"               = "Lähetä videoita automaattisesti";
"_autoupload_description_"          = "Uudet kuvat/videot lähetetään pilveesi";
"_autoupload_description_background_"  = "This option requires the use of GPS to trigger the detection of new photos/videos in the camera roll once the location changes significantly";
"_autoupload_background_title_"     = "Rajoitukset";
"_autoupload_background_msg_"       = "iOS-järjestelmän rajoitusten vuoksi toiminnon suorittaminen taustalla ei ole mahdollista, jos sijaintipalvelut eivät ole käytössä. Kun laitteen sijainti muuttuu, järjestelmä herää lyhyeksi ajaksi. Tänä aikana tarkistetaan uudet kuvat ja lähetetään ne pilveen.";
"_autoupload_change_location_"      = "Vaihda kansiota";
"_autoupload_location_now_"         = "Kansio";
"_autoupload_location_default_"     = "Palauta oletuskansio";
"_autoupload_change_location_footer_" = "Change folder used for 'Automatic upload of camera photos' (if the option is enabled)";
"_autoupload_not_select_home_"      = "Valitse kansio";
"_autoupload_save_album_"           = "Kopioi kuva tai video kuva-albumiin";
"_autoupload_fullphotos_"           = "Lähetä koko kameran rulla";
"_autoupload_fullphotos_footer_"    = "Laita ylempänä olevat asetukset kohilleen ennen lähetystä.";
"_autoupload_create_subfolder_"     = "Käytä alikansioita";
"_autoupload_create_subfolder_footer_" = "Tallenna alikansioihin vuoden ja kuukauden mukaisesti";
"_autoupload_filenamemask_"         = "Muuta tiedostojen nimeämiskäytäntöä";
"_autoupload_filenamemask_footer_"  = "Muuta tiedostojen automaattista nimeämiskäytäntöä";
"_autoupload_current_folder_"       = "Currently selected folder";

// Manage Help

"_help_tutorial_"               = "Opastuskierros";
"_help_intro_"                  = "Nextcloud-perehdytys";
"_help_activity_verbose_"       = "Yksityiskohtainen toimintasyöte";
"_help_activity_mail_"          = "Lähetä toimet sähköpostitse";
"_help_activity_clear_"         = "Tyhjennä toimet";


// Manage Advanced

"_show_hidden_files_"           = "Näytä piilotetut tiedostot";
"_format_compatibility_"        = "Yhteensopivin";
"_format_compatibility_footer_" = "\"Most compatible\" will save, when possible, photos as JPEG";

// Login

"_connect_server_anyway_"       = "Haluatko silti yhdistää palvelimeen?";
"_connection_error_"            = "Yhteysvirhe";
"_serverstatus_error_"          = "Connection to server failure, verify your server address or network status";
"_add_your_nextcloud_"          = "Lisää Nextcloud-tilisi";
"_login_url_"                   = "Palvelimen osoite https://…";
"_login_bottom_label_"          = "Eikö sinulla ole vielä palvelinta?\nValitse yksi palveluntarjoajista.";
"_error_multidomain_"           = "Osoite ei kelpaa, ainoastaan seuraavat verkkotunnukset ovat sallittuja:";
"_account_already_exists_"      = "Tunnus %@ on jo olemassa";
"_traditional_login_"           = "Revert to old login method";
"_web_login_"                   = "Revert to web login method";

// Favorite

"_favorites_"                   = "Suosikit";
"_favorite_"                    = "Suosikki";
"_unfavorite_"                  = "Poista suosikeista";
"_no_files_uploaded_"           = "Ei tiedostoja lähetetty";
"_tutorial_favorite_view_"      = "Suosikeiksi merkitsemäsi tiedostot ja kansiot näkyvät tässä";
"_tutorial_offline_view_"       = "Files copied here will be available offline.\n\nThey will be synchronized with your cloud.";
"_tutorial_local_view_"         = "You'll find the unpacked files from your cloud.\n\nConnect to iTunes to share these files.";
"_more_"                        = "Lisää";
"_favorite_no_files_"           = "Ei vielä suosikkeja";


// Auto Upload

"_pull_down_"                               = "Vedä alaspäin päivittääksesi";
"_no_photo_load_"                           = "Ei kuva eikä video";
"_tutorial_autoupload_view_"                = "You can enable auto uploads from \"Settings\"";
"_no_date_"                                 = "No date";
"_today_"                                   = "Tänään";
"_time_"                                    = "Aika: %@\n\n%@";
"_location_not_enabled_"                    = "Location Services not enabled";
"_location_not_enabled_msg_"                = "Please go to \"Settings\" and turn on \"Location Services\"";
"_access_photo_not_enabled_"                = "Access to Photos not enabled";
"_access_photo_not_enabled_msg_"            = "Please go to \"Settings\" and turn on \"Photo Access\"";
"_access_photo_location_not_enabled_"       = "Access to Photos and Location not enabled";
"_access_photo_location_not_enabled_msg_"   = "Please go to \"Settings\" and turn on \"Photo Access\" and \"Location Services\"";
"_tutorial_photo_view_"                     = "Ei lähetettyjä kuvia tai videoita";
"_create_full_upload_"                      = "Luodaan arkistoa... Tämä saattaa kestää kauan, ole hyvä ja odota.";
"_error_createsubfolders_upload_"           = "Virhe alikansioita luotaessa";
"_activate_autoupload_"                     = "Ota automaattinen lähetys käyttöön";

// Utility

"_never_"                       = "ei koskaan";
"_less_a_minute_"               = "alle minuutti sitten";
"_minutes_ago_"                 = "%d minuuttia sitten";
"_hours_ago_"                   = "%d tuntia sitten";
"_days_ago_"                    = "%d päivää sitten";
"_connection_internet_offline_" = "The Internet connection appears to be offline or Wi-Fi is required";
"_insert_password_"             = "anna salasana";
"_update_in_progress_"          = "Versiopäivitys, ole hyvä ja odota...";
"_forbidden_characters_"        = "Tiedoston tai kansion nimi sisältää virheellisiä merkkejä";
"_mail_not_can_send_mail_"      = "No account set up, or wrong email address entered";

// File

"_photo_camera_"                = "Kuvat";
"_media_"                       = "Media";
"_unzip_in_progress_"           = "Extraction in progress on local storage…";
"_file_unpacked_"               = "File unpacked on local storage";
"_file_saved_local_"            = "Tiedosto tallennettu paikalliseen muistiin.";
"_file_not_present_"            = "Virhe: Tiedostoa ei löydy, ole hyvä ja päivitä.";
"_order_by_"                    = "Sort by";
"_order_by_name_a_z_"           = "Sort by name (from A to Z)";
"_order_by_name_z_a_"           = "Sort by name (from Z to A)";
"_order_by_date_more_recent_"   = "Sort from the most recent";
"_order_by_date_less_recent_"   = "Sort from the less recent";
"_order_by_size_smallest_"      = "Sort from the smallest";
"_order_by_size_largest_"       = "Sort from the largest";
"_delete_selected_files_"       = "Poista tiedostoja";
"_move_selected_files_"         = "Siirrä tiedostoja";
"_download_selected_files_"     = "Lataa tiedostoja";
"_download_selected_files_folders_" = "Lataa tiedostoja ja kansioita";
"_error_operation_canc_"        = "Virhe: Toiminto peruutettu.";
"_only_lock_passcode_"          = "Käytettävissä vain salasanasuojauksen ollessa käytössä. Ota suojaus käyttöön asetuksissa.";
"_passcode_protection_"         = "Salasanasuojaus";
"_remove_favorites_"            = "Poista suosikeista";
"_remove_offline_"              = "Remove from offline";
"_add_favorites_"               = "Lisää suosikkeihin";
"_add_offline_"                 = "Add to offline";
"_remove_passcode_"             = "Remove password protection";
"_protect_passcode_"            = "Suojaa salasanalla";
"_share_"                       = "Jaa";
"_reload_"                      = "Lataa uudelleen";
"_open_in_"                     = "Avaa kohteessa...";
"_remove_local_file_"           = "Poista välimuistista";
"_add_local_"                   = "Lisää paikalliseen muistiin";
"_comm_erro_pull_down_"         = "Attention: Communication error with the server. Pull down to refresh.";
"_file_not_downloaded_"         = "tiedostoa ei ole ladattu";
"_file_not_uploaded_"           = "tiedostoa ei ole lähetetty";
"_folders_"                     = "kansiot";
"_folder_"                      = "kansio";
"_files_"                       = "tiedostot";
"_file_"                        = "file";
"_folder_blocked_"              = "Kansio estetty";
"_downloading_progress_"        = "Aloitetaan tiedostojen lataamista...";
"_no_file_pull_down_"           = "Lähetä tiedosto tai vedä alas päivittääksesi";
"_browse_images_"               = "Selaa kuvia";
"_synchronized_folder_"         = "Pidä kansio synkronoituna";
"_remove_synchronized_folder_"  = "Turn off the synchronization";
"_synchronized_confirm_"        = "After enabling the synchronization, all files in the folder will be synchronized with the server, continue?";
"_offline_folder_confirm_"      = "After enabling the offline folder, all files in it will be synchronized with the server, continue?";
"_file_not_found_reload_"       = "Tiedostoa ei löytynyt, vedä alas päivittääksesi";
"_title_section_download_"      = "LATAA";
"_title_section_upload_"        = "LÄHETÄ";
"_group_alphabetic_yes_"        = "✓ Group alphabetically";
"_group_alphabetic_no_"         = "Group alphabetically";
"_group_typefile_yes_"          = "✓ Ryhmittele tiedostotyypin mukaan";
"_group_typefile_no_"           = "Ryhmittele tiedostotyypin mukaan";
"_group_date_yes_"              = "✓ Ryhmittele päiväyksen mukaan";
"_group_date_no_"               = "Ryhmittele päiväyksen mukaan";
"_element_"                     = "element";
"_elements_"                    = "elements";
"_tite_footer_upload_wwan_"     = "Wi-Fi-yhteys vaaditaan, %lu %@ lähetettävänä";
"_tite_footer_upload_"          = "%lu %@ lähetettävänä";
"_tite_footer_download_wwan_"   = "Wi-Fi-yhteys vaaditaan, %lu %@ ladattavana";
"_tite_footer_download_"        = "%lu %@ ladattavana";
"_limited_dimension_"           = "Maximum size reached";
"_save_selected_files_"         = "Save images and videos to photo album";
"_file_not_saved_cameraroll_"   = "Error: File not saved in photo album";
"_file_saved_cameraroll_"       = "File saved in photo album";
"_directory_on_top_yes_"        = "✓ Kansiot ensin";
"_directory_on_top_no_"         = "Kansiot ensin";
"_folder_automatic_upload_"     = "Folder for \"Auto upload\"";
"_search_no_record_found_"      = "Ei tuloksia";
"_search_in_progress_"          = "Haku käynnissä…";
"_search_instruction_"          = "Etsi tiedosto (vähintään 2 merkkiä)";
"_files_no_files_"              = "Täällä ei ole tiedostoja";
"_files_no_folders_"            = "Ei kansioita täällä";
"_request_in_progress_"         = "Request to server in progress…";

"audio"                         = "ÄÄNI";
"compress"                      = "PAKATUT";
"directory"                     = "KANSIOT";
"document"                      = "DOKUMENTIT";
"image"                         = "KUVAT";
"template"                      = "MALLIPOHJAT";
"unknow"                        = "TUNTEMATON";
"video"                         = "VIDEO";

"_file_del_only_local_"         = "File not present on server";

"_copy_file_"                   = "Kopioi tiedosto";
"_copy_files_"                  = "Kopioi tiedostot";
"_paste_file_"                  = "Liitä tiedosto";
"_paste_files_"                 = "Liitä tiedostoja";

"_search_this_folder_"          = "Etsi tästä kansiosta";
"_search_all_folders_"          = "Etsi kaikista kansioista";
"_search_sub_folder_"           = "Etsi täältä ja alikansioista";

"_theming_is_light_"            = "Server theming too brightly coloured, not applicable";
"_cancel_all_task_"             = "Cancel all transfers";

"_status_wait_download_"        = "Waiting for download";
"_status_in_download_"          = "In download";
"_status_downloading_"          = "Downloading";
"_status_wait_upload_"          = "Waiting for upload";
"_status_in_upload_"            = "In upload";
"_status_uploading_"            = "Uploading";

// Media

"_select_media_folder_"         = "Select the \"Media\" folder";
"_media_viewimage_show_"        = "Näytä kuvat";
"_media_viewimage_hide_"        = "Piilota kuvat";
"_media_viewvideo_show_"        = "Näytä video";
"_media_viewvideo_hide_"        = "Piilota video";

// Files Preview

"_insert_password_pfd_"         = "Suojattu PDF. Syötä salasana";
"_password_pdf_error_"          = "Väärä salasana";
"_error_download_photobrowser_" = "Error: Unable to download photo";

// Share

"_share_link_"                  = "Jaa linkki";
"_share_link_button_"           = "Lähetä linkki…";
"_password_"                    = "Salasana";
"_share_password_"              = "Salasanasuojattu linkki";
"_share_expirationdate_"        = "Aseta vanhenemispäivä linkille";
"_date_"                        = "Päiväys";
"_share_title_"                 = "Jaa";
"_add_sharee_"                  = "Lisää käyttäjiä tai ryhmiä";
"_add_sharee_footer_"           = "Voit jakaa tämän resurssin lisäämällä käyttäjiä tai ryhmiä. Poistaaksesi jaon, poista kaikki käyttäjät ja ryhmät";
"_find_sharee_title_"           = "Etsi";
"_find_sharee_"                 = "Etsi käyttäjä tai ryhmä…";
"_find_sharee_footer_"          = "Enter part of the name of the user or group to search for (at least 2 characters) followed by 'Return', select the users that should be allowed to access the share followed by 'Done' to confirm";
"_user_is_group_"               = "(ryhmä)";
"_direct_sharee_title_"         = "Jaa";
"_direct_sharee_footer_"        = "If you already know the name, enter it, then select the share type and press 'Done' to confirm";
"_direct_sharee_"               = "Anna käyttäjänimi…";
"_user_sharee_footer_"          = "Tap to change permissions";
"_share_type_title_"            = "Jaon tyyppi";
"_share_type_user_"             = "Käyttäjä";
"_share_type_group_"            = "Ryhmä";
"_share_type_remote_"           = "Etä";

// Share Permission

"_share_permission_title_"          = "Oikeudet";
"_share_permission_edit_"           = "Voi muokata";
"_share_permission_file_can_write_" = "Voi kirjoittaa tiedostoon";
"_share_permission_create_"         = "Voi luoda";
"_share_permission_create_file_"    = "Voi luoda tiedostoja";
"_share_permission_create_folder_"  = "Voi luoda kansioita";
"_share_permission_change_"         = "Voi vaihtaa";
"_share_permission_delete_"         = "Voi poistaa";
"_share_permission_share_"          = "Voi jakaa";
"_share_permission_rename_"         = "Voi uudelleennimetä";
"_share_permission_move_"           = "Voi siirtää";
"_share_permission_read_"           = "Voi lukea";
"_share_permission_info_"           = "Jakamisen tiedot";
"_share_permission_path_"           = "Tiedosto/Kansio";
"_share_permission_type_"           = "Tyyppi";
"_share_permission_typeuser_"       = "Käyttäjä";
"_share_permission_typegroup_"      = "Ryhmä";
"_share_permission_typepubliclink_" = "Linkki";
"_share_permission_typefederated_"  = "Federated";
"_share_permission_owner_"          = "Omistaja";
"_share_permission_date_"           = "Päiväys";
"_share_permission_email_"          = "Sähköposti-ilmoitus";
"_share_link_readonly_"             = "Vain luku";
"_share_link_modify_"               = "Salli muokkaus";
"_share_link_upload_"               = "File drop (upload only)";
"_share_link_upload_modify_"        = "Allow upload and editing";
"_share_link_hide_download_"        = "Hide download";

// ShareInfoCMOC

"_type_resource_connect_you_"       = "Jaettu kanssasi";
"_type_resource_external_"          = "Ulkoinen tallennustila";

// Share Ext

"_destiny_folder_"                  = "Kansio: %@";

"_no_transfer_"                     = "Ei siirtoja";
"_no_transfer_sub_"                 = "Tältä laitteelta suoritetut lähetykset ja lataukset näkyvät tässä";
"_no_activity_"                     = "Ei toimia vielä";
"_transfers_"                       = "Siirrot";
"_activity_"                        = "Toimet";
"_activity_file_not_present_"       = "Tiedostoa ei ole enää olemassa";

// List Shares

"_list_shares_"                     = "Jaot";
"_list_shares_no_files_"            = "Ei mitään jaettua";
"_tutorial_list_shares_view_"       = "Jakamasi tiedostot ja kansiot näkyvät tässä";

// Offline - Local Storage

"_create_synchronization_"          = "Create synchronization";
"_offline_"                         = "Offline";
"_local_storage_"                   = "Paikallinen tallennustila";
"_local_storage_no_record_"         = "Ei tiedostoja vielä";

// Create Cloud

"_upload_photos_videos_"            = "Lähetä kuvia tai vidoita";
"_upload_file_"                     = "Lähetä tiedosto";
"_upload_file_text_"                = "Luo tekstitiedosto";

// Document Picker

"_save_document_picker_"            = "Tallenna tänne";

// CreateFormUploadAssets

"_destination_folder_"              = "Kohdekansio";
"_use_folder_auto_upload_"          = "Use the \"Auto upload\" folder as destination";
"_rename_filename_"                 = "Nimeä uudelleen";
"_filename_"                        = "Tiedostonimi";
"_preview_filename_"                = "Example preview of filename. You can use the mask %@ for date/time";
"_forbidden_characters_"            = "Tiedoston tai kansion nimi sisältää virheellisiä merkkejä";
"_add_filenametype_"                = "Specify type in filename";
"_filenametype_photo_video_"        = "Kuva/video";
"_maintain_original_filename_"      = "Maintain original filename";

// Notification

"_notification_"                    = "Ilmoitus";

// Photo Browser

"Done"                              = "Valmis";
"Select Photos"                     = "Valitse kuvia";
"photo"                             = "kuva";
"photos"                            = "kuvaa";
"of"                                = "/";
"%i of %i"                          = "%1$i / %2$i";

// Manage Auto Upload FileName

"_autoupload_filename_title_"       = "Auto upload filename";

// Text File

"_untitled_txt_"                    = "Nimetön.txt";

// EndToEnd Encryption

"_e2e_settings_title_"              = "Salaus";
"_e2e_settings_"                    = "Päästä päähän -salaus";
"_e2e_settings_start_"              = "Käynnistä päästä päähän -salaus";
"_e2e_settings_not_available_"      = "Päästä päähän -salaus ei saatavilla";
"_e2e_settings_activated_"          = "Päästä päähän -salaus aktivoitu";
"_e2e_settings_view_passphrase_"    = "Kaikki 12 sanaa yhdessä on hyvin vahva salasana, jonka avulla pystyy katselemaan ja käyttämään salattuja tiedostoja. Ota ne talteen ja säilytä turvallisessa paikassa. Älä jätä pöydälle!";
"_e2e_settings_read_passphrase_"    = "Read passphrase";
"_e2e_settings_lock_not_active_"    = "Lock not active, go back to \"Settings\" and activate it";
"_e2e_settings_the_passphrase_is_"  = "The passphrase is:";
"_e2e_passphrase_request_title_"    = "Request passphrase";
"_e2e_passphrase_request_message_"  = "Insert the 12 words";
"_e2e_settings_remove_"             = "Remove the encryption locally";
"_e2e_settings_remove_message_"     = "Confirm removal of encryption along with the passphrase.";
"_e2e_set_folder_encrypted_"        = "Encrypt";
"_e2e_remove_folder_encrypted_"     = "Decrypt";
"_e2e_goto_settings_for_enable_"    = "This is an encrypted directory, go to \"Settings\" and enable end-to-end encryption";
"_e2e_delete_folder_not_permitted_" = "Deletion of the directory marked as 'encrypted' is not allowed";
"_e2e_error_encode_metadata_"       = "Serious internal error in encoding metadata";
"_e2e_error_decode_metadata_"       = "Serious internal error in decoding metadata";
"_e2e_error_create_encrypted_"      = "Salattua tiedostoa ei voitu luoda ";
"_e2e_error_update_metadata_"       = "Update metadata error";
"_e2e_error_store_metadata_"        = "Could not save metadata";
"_e2e_error_send_metadata_"         = "Could not send metadata";
"_e2e_error_delete_metadata_"       = "Could not delete metadata";
"_e2e_error_get_metadata_"          = "Could not fetch metadata";
"_e2e_error_not_enabled_"           = "Serious internal error. End-to-end encryption not enabled";
"_e2e_error_record_not_found_"      = "Serious internal error. Records not found";
"_e2e_error_unlock_"                = "Could not unlock folder";
"_e2e_error_lock_"                  = "Could not lock folder";
"_e2e_error_delete_mark_folder_"    = "Decrypt marked folder";
"_e2e_error_mark_folder_"           = "Salaa kansio";
"_e2e_error_directory_not_empty_"   = "Hakemisto ei ole tyhjä";

// Scan Document

"_scans_document_"                  = "Scans document";
"_scanned_images_"                  = "Scanned images";
"_scan_document_pdf_page_"          = "Sivu";
"_scan_label_document_zone_"        = "Drag images down for document creation";
"_filter_original_"                 = "Alkuperäinen";
"_filter_bn_"                       = "Mustavalkoinen";
"_filter_grayscale_"                = "Harmaasävy";
"_quality_image_title_"             = "Kuvan laatu";
"_quality_high_"                    = "Large file size of high quality";
"_quality_medium_"                  = "Average file size of medium quality";
"_quality_low_"                     = "Small file size of low quality";
"_file_type_"                       = "File type";
"_pdf_password_"                    = "PDF-salasana";
"_file_creation_"                   = "File creation";
"_delete_all_scanned_images_"       = "Do you want to delete all scanned images?";

/* The title on the navigation bar of the Scanning screen. */
"wescan.scanning.title"             = "Scanning";
/* The "Next" button on the right side of the navigation bar on the Edit screen. */
"wescan.edit.button.next"           = "Next";
/* The title on the navigation bar of the Edit screen. */
"wescan.edit.title"                 = "Edit Scan";
/* The "Done" button on the right side of the navigation bar on the Review screen. */
"wescan.review.button.done"         = "Done";
/* The title on the navigation bar of the Review screen. */
"wescan.review.title"               = "Review";

// Trah

"_trash_view_"                      = "Deleted files";
"_trash_restore_all_"               = "Restore all files";
"_trash_delete_all_"                = "Empty trash";
"_trash_no_trash_"                  = "No files deleted";
"_trash_no_trash_description_"      = "You can restore deleted files from here";
"_trash_restore_selected_"          = "Restore selected files";
"_trash_delete_selected_"           = "Deleted selected files";

// Offline

"_manage_file_offline_"             = "Manage file offline";
"_set_available_offline_"           = "Set as available offline";
"_remove_available_offline_"        = "Remove as available offline";

// Richdocuments

"_create_new_document_"             = "Luo uusi asiakirja";
"_create_new_spreadsheet_"          = "Luo uusi taulukko";
"_create_new_presentation_"         = "Luo uusi esitys";

// Intro

"_intro_1_title_"                   = "Keep your data secure and under your control";
"_intro_2_title_"                   = "Secure collaboration & file exchange";
"_intro_3_title_"                   = "Easy-to-use web mail, calendering & contacts";
"_intro_4_title_"                   = "Screensharing, online meetings & web conferences";

"_log_in_"                          = "Kirjaudu";
"_sign_up_"                         = "Sign up with provider";
"_host_your_own_server"             = "Host your own server";

// Error

"_bad_username_password_"               = "Väärä käyttäjätunnus tai salasana";
"_cancelled_by_user"                    = "Siirto peruttu";
"_error_folder_destiny_is_the_same_"    = "Kansiota ei voi siirtää itseensä ";
"_error_not_permission_"                = "Sinulla ei ole oikeuksia toteuttaa tätä toimintoa";
"_error_path_"                          = "Tiedoston tai kansion avaaminen epäonnistui. Varmista, että se on olemassa";
"_file_upload_not_exitst_"              = "Lähetettävää tiedostoa ei ole olemassa";
"_forbidden_characters_from_server_"    = "Nimi sisältää vähintään yhden virheellisen merkin";
"_not_connected_internet_"              = "Palvelimen yhteysvirhe";
"_not_possible_connect_to_server_"      = "Palvelimeen ei juuri nyt saatu yhteyttä";
"_not_possible_create_folder_"          = "Kansion luominen epäonnistui";
"_server_down_"                         = "Yhteyden muodostaminen palvelimeen ei onnistu ";
"_time_out_"                            = "Aikakatkaisu, yritä uudelleen";
"_unknow_response_server_"              = "Odottamaton vastaus palvelimelta";
"_user_autentication_required_"         = "Käyttäjätunnistautuminen vaaditaan";
"_file_directory_locked_"               = "Tiedosto tai hakemisto on lukittu";
"_ssl_certificate_untrusted_"           = "Palvelimen sertifikaatti on virheellinen";
"_internal_server_"                     = "Sisäinen palvelinvirhe";
"_file_already_exists_"                 = "Toiminto epäonnistui, koska samanniminen tiedosto on jo olemassa";
"_file_folder_not_exists_"              = "Lähdetiedostoa ei löytynyt määritellystä sijainnista";
"_folder_contents_nochanged_"           = "Kansion sisältö ei ole muuttunut";
"_images_invalid_converted_"            = "Kuva on virheellinen, eikä siitä voi luoda esikatselukuvaa";
"_method_not_expected_"                 = "Odottamaton pyyntömetodi";
"_reauthenticate_user_"                 = "Access expired, log in again";
"_server_error_retry_"                  = "Palvelin on tilapäisesti pois käytöstä";
"_too_many_files_"                      = "Too many files would be involved in this operation";
"_too_many_request_"                    = "Sending too many requests caused the rate limit to be reached";
"_user_over_quota_"                     = "Levytila saavutettu";
"_ssl_connection_error_"                = "SSL-yhteysvirhe, yritä uudelleen";
"_bad_request_"                         = "Virheellinen pyyntö";
"_webdav_locked_"                       = "WebDAV Locked: Trying to access locked resource";
"_error_user_not_available_"            = "Käyttäjä ei ole enää tavoitettavissa";
"_server_response_error_"               = "Palvelinvastauksen sisältövirhe";

// BKPasscode

"%d Failed Passcode Attempts" = "%d epäonnistunutta pääsykoodiyritystä";
"%d Failed Password Attempts" = "%d epäonnistunutta salasanayritystä";

"1 Failed Passcode Attempt" = "1 epäonnistunut pääsykoodiyritys";
"1 Failed Password Attempt" = "1 epäonnistunut salasanayritys";

"Do you want to use Touch ID for authentication?" = "Do you want to use Touch/Face ID for authentication?";

"Done" = "Valmis";

"Enable Touch ID" = "Enable Touch/Face ID";

"Enter a different passcode. Cannot re-use the same passcode." = "Syötä eri pääsykoodi. Et voi uudelleenkäyttää samaa pääsykoodia.";
"Enter a different password. Cannot re-use the same password." = "Syötä eri salasana. Et voi uudelleenkäyttää samaa salasanaa.";

"Enter a passcode" = "Syötä pääsykoodi";
"Enter a password" = "Syötä salasana";

"Enter your new passcode" = "Syötä uusi pääsykoodi";
"Enter your new password" = "Syötä uusi salasana";

"Enter your old passcode" = "Syötä vanha pääsykoodi";
"Enter your old password" = "Syötä vanha salasana";

"Enter your passcode" = "Syötä pääsykoodisi";
"Enter your password" = "Syötä salasanasi";

"Invalid Passcode" = "Virheellinen pääsykoodi";
"Invalid Password" = "Virheellinen salasana";

"Passcodes did not match.\nTry again." = "Pääsykoodit eivät täsmänneet.\nYritä uudelleen.";
"Password did not match.\nTry again." = "Salasanat eivät täsmänneet.\nYritä uudelleen.";

"Re-enter your passcode" = "Uudelleensyötä pääsykoodi";
"Re-enter your password" = "Uudelleensyötä salasana";

"Try again in %d minutes" = "Yritä uudelleen %d minuutin kuluttua";

"Try again in 1 minute" = "Yritä uudelleen 1 minuutin kuluttua";

